report/test1/iteration2/report2.txt
Server Software:        nginx/1.23.1
Server Hostname:        127.0.0.1
Server Port:            3000

Document Path:          /api/tasks
Document Length:        95 bytes

Concurrency Level:      100
Time taken for tests:   632.034 seconds
Complete requests:      1000
Failed requests:        600
   (Connect: 0, Receive: 0, Length: 600, Exceptions: 0)
Non-2xx responses:      600
Keep-Alive requests:    1000
Total transferred:      297000 bytes
Total body sent:        8737943000
HTML transferred:       138200 bytes
Requests per second:    1.58 [#/sec] (mean)
Time per request:       63203.418 [ms] (mean)
Time per request:       632.034 [ms] (mean, across all concurrent requests)
Transfer rate:          0.46 [Kbytes/sec] received
                        13501.09 kb/s sent
                        13501.54 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    8  27.0      0     151
Processing:   718 59993 7045.3  60690   79323
Waiting:      664 59963 7054.2  60649   79232
Total:        719 60001 7041.8  60690   79422

Percentage of the requests served within a certain time (ms)
  50%  60690
  66%  61111
  75%  61507
  80%  61751
  90%  62697
  95%  64106
  98%  72521
  99%  75015
 100%  79422 (longest request)